{
	"Id": "DE1_6SEC_MAGAGMS",
	"Observatory": [
		"DE"
	],
	"Instrument": [
		"6sec"
	],
	"ObservatoryGroup": [
		"DE"
	],
	"InstrumentType": [
		"Particles (space)"
	],
	"Label": "DE-1 Magnetometer (MAG-A) 6 second GMS Data - Dr. Masahisa Sugiura (NASA/GSFC)",
	"TimeInterval": {
		"Start": "1981-09-15T05:40:30.000Z",
		"End": "1991-02-18T09:55:45.000Z"
	},
	"PiName": "Dr. Masahisa Sugiura",
	"PiAffiliation": "NASA/GSFC",
	"Notes": "http://cdaweb.gsfc.nasa.gov/misc/NotesD.html#DE1_6SEC_MAGAGMS",
	"VariableDescription": [
		{
			"Name": "brGEO",
			"ShortDescription": "",
			"LongDescription": "Radial-Component of reference magnetic field (MAGSAT model) in GEO coord.",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Radial-Component of reference magnetic field (MAGSAT model) in GEO coord.\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:31 2015\n",
			"VariableInfo": "#  2. Radial-Component of reference magnetic field (MAGSAT model) in GEO coord.\n#\nTIME_SINCE_0_A.D.(VEFI) BR-MODEL(GEO)\ndd-mm-yyyy hh:mm:ss.ms             nT\n15-09-1981 05:40:30.272       27698.7",
			"Cadence": "6000"
		},
		{
			"Name": "bthGEO",
			"ShortDescription": "",
			"LongDescription": "Theta-Component ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Theta-Component ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:31 2015\n",
			"VariableInfo": "#  2. Theta-Component ...\n#\nTIME_SINCE_0_A.D.(VEFI) BTH-MODEL(GEO)\ndd-mm-yyyy hh:mm:ss.ms              nT\n15-09-1981 05:40:30.272       -12619.8",
			"Cadence": "6000"
		},
		{
			"Name": "bphGEO",
			"ShortDescription": "",
			"LongDescription": "Phi-Component ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Phi-Component ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:32 2015\n",
			"VariableInfo": "#  2. Phi-Component ...\n#\nTIME_SINCE_0_A.D.(VEFI) BPH-MODEL(GEO)\ndd-mm-yyyy hh:mm:ss.ms              nT\n15-09-1981 05:40:30.272        7096.90",
			"Cadence": "6000"
		},
		{
			"Name": "bpara",
			"ShortDescription": "",
			"LongDescription": "Parallel Component of Difference Magnetic Field in Local Magnetic (LMG) Coord.",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Parallel Component of Difference Magnetic Field in Local Magnetic (LMG) Coord.\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:32 2015\n",
			"VariableInfo": "#  2. Parallel Component of Difference Magnetic Field in Local Magnetic (LMG) Coord.\n#\nTIME_SINCE_0_A.D.(VEFI) BPARA-DIFF(LMG)\ndd-mm-yyyy hh:mm:ss.ms               nT\n15-09-1981 05:40:30.272         69.2000",
			"Cadence": "6000"
		},
		{
			"Name": "bparp1",
			"ShortDescription": "",
			"LongDescription": "Perpendicular(1) Component ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Perpendicular(1) Component ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:32 2015\n",
			"VariableInfo": "#  2. Perpendicular(1) Component ...\n#\nTIME_SINCE_0_A.D.(VEFI) BPERP1-DIFF(LMG)\ndd-mm-yyyy hh:mm:ss.ms                nT\n15-09-1981 05:40:30.272         -252.040",
			"Cadence": "6000"
		},
		{
			"Name": "bparp2",
			"ShortDescription": "",
			"LongDescription": "Perpendicular(2) Component  ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Perpendicular(2) Component  ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:33 2015\n",
			"VariableInfo": "#  2. Perpendicular(2) Component  ...\n#\nTIME_SINCE_0_A.D.(VEFI) BPERP2-DIFF(LMG)\ndd-mm-yyyy hh:mm:ss.ms                nT\n15-09-1981 05:40:30.272         -129.770",
			"Cadence": "6000"
		},
		{
			"Name": "brGMS",
			"ShortDescription": "",
			"LongDescription": "Radial-Component of Difference Magnetic Field in GMS coord.",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Radial-Component of Difference Magnetic Field in GMS coord.\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:33 2015\n",
			"VariableInfo": "#  2. Radial-Component of Difference Magnetic Field in GMS coord.\n#\nTIME_SINCE_0_A.D.(VEFI)  BR-DIFF(GMS)\ndd-mm-yyyy hh:mm:ss.ms             nT\n15-09-1981 05:40:30.272      -55.5000",
			"Cadence": "6000"
		},
		{
			"Name": "bthGMS",
			"ShortDescription": "",
			"LongDescription": "Theta-Component of ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Theta-Component of ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:34 2015\n",
			"VariableInfo": "#  2. Theta-Component of ...\n#\nTIME_SINCE_0_A.D.(VEFI) BTH-DIFF(GMS)\ndd-mm-yyyy hh:mm:ss.ms             nT\n15-09-1981 05:40:30.272      -285.270",
			"Cadence": "6000"
		},
		{
			"Name": "bphGMS",
			"ShortDescription": "",
			"LongDescription": "Phi-Component of ...",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Phi-Component of ...\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:34 2015\n",
			"VariableInfo": "#  2. Phi-Component of ...\n#\nTIME_SINCE_0_A.D.(VEFI) BPH-DIFF(GMS)\ndd-mm-yyyy hh:mm:ss.ms             nT\n15-09-1981 05:40:30.272      -27.7500",
			"Cadence": "6000"
		},
		{
			"Name": "glon",
			"ShortDescription": "",
			"LongDescription": "Geographic Longitude",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Geographic Longitude\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:35 2015\n",
			"VariableInfo": "#  2. Geographic Longitude\n#\nTIME_SINCE_0_A.D.(VEFI)      GEO_LONG\ndd-mm-yyyy hh:mm:ss.ms            deg\n15-09-1981 05:40:30.272      -98.1300",
			"Cadence": "6000"
		},
		{
			"Name": "glat",
			"ShortDescription": "",
			"LongDescription": "Geographic Latitude",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Geographic Latitude\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:35 2015\n",
			"VariableInfo": "#  2. Geographic Latitude\n#\nTIME_SINCE_0_A.D.(VEFI)      GEO_LATI\ndd-mm-yyyy hh:mm:ss.ms            deg\n15-09-1981 05:40:30.272      -60.3500",
			"Cadence": "6000"
		},
		{
			"Name": "ilat",
			"ShortDescription": "",
			"LongDescription": "Invariant Latitude",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Invariant Latitude\n#       NOTES:  The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database.\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:36 2015\n",
			"VariableInfo": "#       NOTES:  The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database.\n#\nTIME_SINCE_0_A.D.(VEFI)       INV_LAT\ndd-mm-yyyy hh:mm:ss.ms            deg\n15-09-1981 05:40:30.272       51.3400",
			"Cadence": "6000"
		},
		{
			"Name": "mlt",
			"ShortDescription": "",
			"LongDescription": "Magnetic Local Time",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Magnetic Local Time\n#       NOTES:  The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database.\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:36 2015\n",
			"VariableInfo": "#       NOTES:  The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database.\n#\nTIME_SINCE_0_A.D.(VEFI)           MLT\ndd-mm-yyyy hh:mm:ss.ms             hr\n15-09-1981 05:40:30.272       23.7000",
			"Cadence": "6000"
		},
		{
			"Name": "alt",
			"ShortDescription": "",
			"LongDescription": "Altitude in km",
			"Header": "#              ************************************\n#              *****    GLOBAL ATTRIBUTES    ******\n#              ************************************\n#\n#     TITLE                           DE-1 Magnetometer 6 second gms data\n#     PROJECT                         DE>Dynamics Explorer\n#     SOURCE_NAME                     DE>Dynamics Explorer\n#     DISCIPLINE                      Space Physics>Magnetospheric  Ionospheric Interactions\n#     DESCRIPTOR                      6sec> 6 second\n#     DATA_TYPE                       magagms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)\n#     DATA_VERSION                    1\n#     TEXT                            Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer                      \n#     TEXT                             program.  The DE-1 and DE-2 satellites were launched by the same vehicle so                           \n#     TEXT                             that their orbits would be coplanar, allowing two-point measurements along                            \n#     TEXT                             magnetic field lines, for the purpose of studying coupling between the magnetosphere,                 \n#     TEXT                             ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with                          \n#     TEXT                             an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was                          \n#     TEXT                             placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized                         \n#     TEXT                             with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized                   \n#                                      with one face being nadir oriented.                                                                   \n#                                     The study of field-aligned currents and MHD waves were the primary objectives                          \n#                                      of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data                         \n#                                      with measurements of precipitating charged particles yielded new information                          \n#                                      on the field-aligned current carriers.  In combination with the electric field                        \n#                                      measurements, it was possible to determine the vertical Poynting Flux of electromagnetic              \n#                                      energy flowing between the magnetosphere and ionosphere and to separate small-scale                   \n#                                      field-aligned currents from MHD waves through the evaluation of the local ratio                       \n#                                      of the electric to magnetic field amplitudes in these perturbations. The field-aligned                \n#                                      current measurements and neutral atmosphere observations also provided an opportunity                 \n#                                      for investigating atmosphere-magnetosphere coupling and assessing the total                           \n#                                      rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer                  \n#                                      investigation provided a vital service in so far as a knowledge of magnetic                           \n#                                      field direction and intensity is essential to any number of space plasma science                      \n#                                      investigations utilizing the various DE-1/2 particles and fields data sets.                           \n#                                     The DE-1 magnetic field (MAG-A) 6-second average resolution data set consists                          \n#                                      of averages of the high resolution triaxial fluxgate measurements taken every                         \n#                                      62.5 msec (i.e., 16 vectors/second).  The MAG-A data set consists of the three                        \n#                                      components of the model magnetic field and difference field, B-Radial (Br),                           \n#                                      B-Theta (Bth), and B-Phi (Bph), in *old* Geomagnetic Spherical (GMS) Coordinates,                     \n#                                      and the difference field in local *new* Geographic Spherical (GGS) and Geomagnetic                    \n#                                      Spherical (GMS) Coordinates, respectively, and the difference field in local                          \n#                                      magnetic coordinates (b-para, b-parp1, b-parp2).  The R, Theta and Phi axes                           \n#                                      are positive in the directions of increasing radial distance from the center                          \n#                                      of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward)                        \n#                                      and increasing azimuth angle (i.e., magnetic east). The reference for the MAGSAT                      \n#                                      magnetic field model is Langel et al., Geophys. Res. Lett., 7, 793, 1980. The                         \n#                                      following Orbit Attitude (OA) parameters are also included in the data set:                           \n#                                      altitude, geographic latitude and longitude, magnetic local time, and invariant                       \n#                                      latitude. The data are provided in daily files in ASCII format. [updated by                           \n#                                      Robert.M.Candey@nasa.gov, 2006 Jan 17, per email dated Date: Thu, 18 Feb 99                           \n#                                      17:08:59 JST From: iyemori@swdcgw.kugi.kyoto-u.ac.jp (Toshihiko_Iyemori)] As                          \n#                                      described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution                   \n#                                      of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity                          \n#                                      modes were used at higher altitudes with digital resolutions of +0.25 nT and                          \n#                                      +0.02 nT, respectively. The data set consists of daily files from 81258 to                            \n#                                      91049 in ASCII format. Each file contains all of the data available for a given                       \n#                                      day.                                                                                                  \n#                                     The dominant source of error in the DE-1 magnetic field measurements is the                            \n#                                      uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed                       \n#                                      to an attitude uncertainty specification of about 0.3 degree which appears                            \n#                                      to have been met much of the time. As a rule of thumb each 0.1 degree in attitude                     \n#                                      uncertainty near perigee corresponds to an error of approximately 100 nT in                           \n#                                      each component of the field when the magnetic field measured at the sensors                           \n#                                      is transferred to an inertial frame of reference or a model field is transferred                      \n#                                      into the 0spacecraft frame and subtracted from the measured field.  For this                          \n#                                      reason it is common for the residual, or delta-B field obtained by subtracting                        \n#                                      the model field at low altitudes (i.e., high fields) to show a gradual shift                          \n#                                      of several 100 nT from the start of a passage across the polar cap to the other                       \n#                                      side.  (These slow shifts in the baselines of the vector field components do                          \n#                                      not affect most scientific analyses, e.g., field-aligned current measurements,                        \n#                                      but they can be effectively dealt with through modeling if need be.  At higher                        \n#                                      altitudes the ambient field intensity is less and the uncertainty due to attitude                     \n#                                      errors is correspondingly smaller.                                                                    \n#                                     The absolute accuracy of the DE-1 total magnetic field measurement has also                            \n#                                      been evaluated through comparison with the precision vector/scalar magnetic                           \n#                                      field observatories located on the ground which are used to monitor the geomagnetic                   \n#                                      field. On the basis of such cross-comparisons utilizing DE-1 perigee data over                        \n#                                      the life of the mission, R. Langel (private communication, 1994) found excellent                      \n#                                      agreement between the MAG-A and ground-based observatory scalar data sets at                          \n#                                      the 20 to 40 nT level.                                                                                \n#                                     In using any unfamiliar data set, caution is advised and tests to screen out                           \n#                                      instrumental artifacts should be devised before reaching important conclusions.                       \n#                                     De-spinning high sensitivity, boom mounted vector magnetometer data in high                            \n#                                      fields (i.e., >1000 nT) frequently results in a readily observable residual                           \n#                                      signal at the spin period and its harmonics. In the case of the DE-1 magnetometer                     \n#                                      measurements, the dominant causes of residual spin tone were found to be small                        \n#                                      (0.1 to 0.01%) changes in the instrument scale factors and boom bending of                            \n#                                      up to several tenths of a degree in response to varying thermal inputs due                            \n#                                      to orbit/attitude driven changes in solar illumination (e.g., seasonal variations,                    \n#                                      eclipses, etc.). These effects were minimized through an orbit by orbit calibration                   \n#                                      procedure which analyzed the residual spin tone around apogee and perigee and                         \n#                                      adjusted the scale factors and sensor attitude accordingly. Even after these                          \n#                                      in-flight calibration activities, residual spin tone signals in the MAG-A data                        \n#                                      with amplitudes of tens of nanotesla are common in high fields around perigee.                        \n#                                      The most probable cause of these residuals is the transverse field dependence                         \n#                                      of fluxgate magnetometers in high fields which was not well-appreciated at                            \n#                                      the time that DE-1/2 magnetometers were designed and calibrated in the late                           \n#                                      1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on                          \n#                                      the low altitude, spin stabilized Freja spacecraft, this non-linear effect                            \n#                                      can easily produce the residual spin frequency signals present in the MAG-A                           \n#                                      data set.                                                                                             \n#                                     The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer                       \n#                                      Investigation) prior to launch and used in the generation of the Orbit-Attitude                       \n#                                      database.                                                                                             \n#     ADID_REF                        NSSD0241\n#     LOGICAL_SOURCE                  de1_6sec_magagms\n#     LOGICAL_FILE_ID                 de1_6sec_magagms_00000000_v01\n#     LOGICAL_SOURCE_DESCRIPTION      DE-1 Magnetometer (MAG-A) 6 second GMS Data\n#     PI_NAME                         Dr. Masahisa Sugiura\n#     PI_AFFILIATION                  NASA/GSFC\n#     NSSDC_ID                        SPMS-00565\n#     MISSION_GROUP                   DE\n#                                     !___Magnetospheric Data\n#                                     !___ITM Data including Earth Imaging and Ground-Based\n#     INSTRUMENT_TYPE                 Particles (space)\n#     SPASE_DATASETRESOURCEID         spase://VMO/NumericalData/DE1/MAGA/PT6S\n#\n#              ************************************\n#              ****  RECORD VARYING VARIABLES  ****\n#              ************************************\n#\n#  1. NSSDC standard-reference time value. (vefi)\n#  2. Altitude in km\n#\n#  \n# Key Parameter and Survey data (labels K0,K1,K2) are preliminary browse data.\n# Generated by CDAWeb on: Thu Jan 15 19:08:37 2015\n",
			"VariableInfo": "#  2. Altitude in km\n#\nTIME_SINCE_0_A.D.(VEFI)      ALTITUDE\ndd-mm-yyyy hh:mm:ss.ms             km\n15-09-1981 05:40:30.272       901.300",
			"Cadence": "6000"
		}
	]
}